-- Active: 1722504789881@@mysql.sqlpub.com@3306@interview_data

CREATE TABLE t_mysql_student (
    sid INT PRIMARY KEY, sname VARCHAR(100), sage DATE, ssex CHAR(1)
);

INSERT INTO
    t_mysql_student (sid, sname, sage, ssex)
VALUES (1, '赵雷', '1990-01-01', '男'),
    (2, '钱电', '1990-12-21', '男'),
    (3, '孙风', '1990-12-20', '男'),
    (4, '李云', '1990-12-06', '男'),
    (5, '周梅', '1991-12-01', '女'),
    (6, '吴兰', '1992-01-01', '女'),
    (7, '郑竹', '1989-01-01', '女'),
    (9, '张三', '2017-12-20', '女'),
    (10, '李四', '2017-12-25', '女'),
    (11, '李四', '2012-06-06', '女'),
    (12, '赵六', '2013-06-13', '女'),
    (13, '孙七', '2014-03-01', '女');